In [1]:
import pandas as pd

In [14]:
dataframe = pd.read_csv('./meteorite-landings.csv')
dataframe.sample(5)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
36891,Saotome,23174,Valid,"Iron, IVA",10880.00,Found,1892.0,36.50000,137.00000,"(36.500000, 137.000000)"
3868,Asuka 880812,3521,Valid,H5,16.94,Found,1988.0,-72.00000,26.00000,"(-72.000000, 26.000000)"
32516,Queen Alexandra Range 93273,19361,Valid,H5,1.10,Found,1993.0,-84.00000,168.00000,"(-84.000000, 168.000000)"
11415,Elephant Moraine 96227,9818,Valid,L5,4.90,Found,1996.0,-76.18333,157.16667,"(-76.183330, 157.166670)"
8238,Dhofar 935,7637,Valid,H5,1500.00,Found,2002.0,19.10500,54.81167,"(19.105000, 54.811670)"

In [7]:
print(dataframe.shape)
print(dataframe.size)

(45716, 10)
457160

In [17]:
pd.options.display.float_format='{:,.1f}'.format
dataframe.describe()

            id         mass     year   reclat  reclong
count 45,716.0     45,585.0 45,428.0 38,401.0 38,401.0
mean  26,889.7     13,278.1  1,991.8    -39.1     61.1
std   16,860.7    574,988.9     27.2     46.4     80.6
min        1.0          0.0    301.0    -87.4   -165.4
25%   12,688.8          7.2  1,987.0    -76.7      0.0
50%   24,261.5         32.6  1,998.0    -71.5     35.7
75%   40,656.8        202.6  2,003.0      0.0    157.2
max   57,458.0 60,000,000.0  2,501.0     81.2    354.5

In [18]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [13]:
dataframe[dataframe['year']==301]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
16356,Havana,11857,Valid,"Iron, IAB complex",NaN,Found,301.0,40.33333,-90.05,"(40.333330, -90.050000)"